Revit 2027 API
PointCloudInstance.GetScans Method
 Returns array of scan names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetScans()
Public Function GetScans As IList(Of String)
public:
IList<String^>^ GetScans()
member GetScans : unit -> IList<string>
Return Value
IList<String>
 Resulting array of scan names.
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace